

'--------------'
'--------------'
'--------------'
'--------------'
'--------------'
'--------------'
puts '5. Дан целочисленный массив. Преобразовать его, прибавив к четным числам первый элемент. Первый и последний элементы массива не изменять.'
array = []
10.times do
	e = rand(100) - 50
	array << e
end
puts array.inspect
array.each_with_index {|e,i| 
  next if (e < 0 )
  array[i] = array.min
}
puts array.inspect
'--------------'
puts '6. Дан целочисленный массив. Преобразовать его, прибавив к четным числам последний элемент. Первый и последний элементы массива не изменять.'

'--------------'
'--------------'
'--------------'
'--------------'
'--------------'
'--------------'
'--------------'
'--------------'
'--------------'
'--------------'
'--------------'
'--------------'
'--------------'
